[Town_Xel.A_Xel_VillageHall H7TownHall]
mName="村镇大厅"
mDesc="允许在此城镇建造新建筑。\n每天提供500黄金 %ICON_GOLD。"

[Town_Xel.A_Xel_TownHall H7TownHall]
mName="城镇大厅"
mDesc="每天额外提供500黄金 %ICON_GOLD。"

[Town_Xel.A_Xel_CityHall H7TownHall]
mName="城市大厅"
mDesc="每天额外提供1000黄金 %ICON_GOLD。"

[Town_Xel.A_Xel_Capitol H7TownHall]
mName="国会"
mDesc="每天额外提供2000黄金 %ICON_GOLD。您只能拥有一个国会。"

[Town_Xel.A_Xel_Fortification1 H7TownGuardBuilding]
mName="防御工事-等级1"
mDesc="为城镇提供城墙和城门\n生产驻军单位，直至达到驻军上限"

[Town_Xel.A_Xel_Fortification2 H7TownGuardBuilding]
mName="防御工事-等级2"
mDesc="加固城堡城墙和城门\n增加最大驻军规模\n增加增长率"

[Town_Xel.A_Xel_Fortification3 H7TownGuardBuilding]
mName="防御工事-等级3"
mDesc="加固城堡城墙和城门\n显著增加最大驻军规模\n降低增长率"

[Town_Xel.A_Xel_Special1 H7TownTower]
mName="风暴发生器"
mDesc="在攻城战中为城镇提供2座塔楼。\n为防守方军队中的单位增加+10 %ICON_ATTACK 攻击力和+15 %ICON_DEFENSE 防御力。"

[Town_Xel.A_Xel_MagicGuild1 H7TownMagicGuild]
mName="魔法行会-等级1"
mDesc="在此城镇提供7个随机的1级法术。\n所有访问此城镇且满足必要条件的英雄将学会它们。"

[Town_Xel.A_Xel_MagicGuild2 H7TownMagicGuild]
mName="魔法行会-等级2"
mDesc="在此城镇提供6个随机的2级法术。\n所有访问此城镇且满足必要条件的英雄将学会它们。"

[Town_Xel.A_Xel_MagicGuild3 H7TownMagicGuild]
mName="魔法行会-等级3"
mDesc="在此城镇提供4个随机的3级法术。\n所有访问此城镇且满足必要条件的英雄将学会它们。"

[Town_Xel.A_Xel_MagicGuild4 H7TownMagicGuild]
mName="魔法行会-等级4"
mDesc="在此城镇提供2个随机的4级法术。\n所有访问此城镇且满足必要条件的英雄将学会它们。"

[Town_Xel.A_Xel_HallOfHeroes H7TownBuilding]
mName="英雄大厅"
mDesc="允许招募英雄，包括新英雄和战败的英雄。新英雄的选择在每周开始时更换。"

[Town_Xel.A_Xel_MineBeetle_1 H7TownDwelling]
mName="孵化场"
mDesc="核心生物住所。\n允许招募矿坑士兵，每周增长率为19。"

[Town_Xel.A_Xel_MineBeetle_2 H7TownDwelling]
mName="洞穴"
mDesc="核心生物住所升级。\n允许招募并将矿坑士兵升级为矿坑哨兵。\n（基础增长率：19/周）"

[Town_Xel.A_Xel_MineBeetle_add H7TownGrowthEnhancer]
mName="传动轴"
mDesc="核心生物住所升级。\n每周+9矿坑士兵或矿坑哨兵。"

[Town_Xel.A_Xel_Searcher_1 H7TownDwelling]
mName="监控中心"
mDesc="核心生物住所。\n允许招募潜行追踪者，每周增长率为20。"

[Town_Xel.A_Xel_Searcher_2 H7TownDwelling]
mName="警戒中心"
mDesc="核心生物住所升级。\n允许招募并将潜行追踪者升级为尖啸者。\n（基础增长率：20/周）"

[Town_Xel.A_Xel_Searcher_add H7TownGrowthEnhancer]
mName="观测台"
mDesc="核心生物住所升级。\n每周+10潜行追踪者或尖啸者。"

[Town_Xel.A_Xel_Scavenger_1 H7TownDwelling]
mName="黑暗实验室"
mDesc="核心生物住所。\n允许招募清道夫，每周增长率为13。"

[Town_Xel.A_Xel_Scavenger_2 H7TownDwelling]
mName="损伤实验室"
mDesc="核心生物住所升级。\n允许招募并将清道夫升级为铁嚼者。\n（基础增长率：13/周）"

[Town_Xel.A_Xel_Scavenger_add H7TownGrowthEnhancer]
mName="支援罐"
mDesc="核心生物住所升级。\n每周+5清道夫或铁嚼者。"

[Town_Xel.A_Xel_Xenophage_1 H7TownDwelling]
mName="异种站"
mDesc="精英生物住所。\n允许招募戈刚，每周增长率为6。"

[Town_Xel.A_Xel_Xenophage_2 H7TownDwelling]
mName="异种站扩展"
mDesc="精英生物住所升级。\n允许招募并将戈刚升级为酸液戈刚。\n（基础增长率：6/周）"

[Town_Xel.A_Xel_Xenophage_add H7TownGrowthEnhancer]
mName="存储盘"
mDesc="精英生物住所升级。\n每周+6戈刚或酸液戈刚。"

[Town_Xel.A_Xel_Enslaver_1 H7TownDwelling]
mName="痛苦大厅"
mDesc="精英生物住所。\n允许招募收割者，每周增长率为4。"

[Town_Xel.A_Xel_Enslaver_2 H7TownDwelling]
mName="折磨大厅"
mDesc="精英生物住所升级。\n允许招募并将收割者升级为幽灵收割者。\n（基础增长率：4/周）"

[Town_Xel.A_Xel_Enslaver_add H7TownGrowthEnhancer]
mName="刑讯室"
mDesc="精英生物住所升级。\n每周+4收割者或幽灵收割者。"

[Town_Xel.A_Xel_Deathbringer_1 H7TownDwelling]
mName="死亡圣殿"
mDesc="精英生物住所。\n允许招募食人魔鼠，每周增长率为2。"

[Town_Xel.A_Xel_Deathbringer_2 H7TownDwelling]
mName="虚空圣殿"
mDesc="精英生物住所升级。\n允许招募并将食人魔鼠升级为突变鼠。\n（基础增长率：2/周）"

[Town_Xel.A_Xel_Deathbringer_add H7TownGrowthEnhancer]
mName="加速器"
mDesc="精英生物住所升级。\n每周+2食人魔鼠或突变鼠。"

[Town_Xel.A_Xel_Moloch_1 H7TownDwelling]
mName="恶意之塔"
mDesc="冠军生物住所。\n允许招募秽巢巨怪，每周增长率为2。"

[Town_Xel.A_Xel_Moloch2 H7TownDwelling]
mName="憎恨之塔"
mDesc="冠军生物住所升级。\n允许招募并将秽巢巨怪升级为秽巢憎恶体。\n（基础增长率：2/周）"

[Town_Xel.A_Xel_Ripper_1 H7TownDwelling]
mName="黑色宫殿"
mDesc="冠军生物住所。\n允许招募巨蝎，每周增长率为2。"

[Town_Xel.A_Xel_Ripper_2 H7TownDwelling]
mName="黑曜石宫殿"
mDesc="冠军生物住所升级。\n允许招募并将巨蝎升级为秽巢蝎。\n（基础增长率：2/周）"

[New_Build.A_Xel_chambre_bio_titan H7TownDwelling]
mName="核电站"
mDesc="冠军生物住所。\n允许招募秽巢巨像。\n可以使用“全部招募”功能招募\n（基础增长率：1/周）"

[New_Build.A_Xel_chambre_elite_puissant H7TownDwelling]
mName="辐射村"
mDesc="精英生物住所。\n允许招募沼泽恶魔。\n可以使用“全部招募”功能招募。\n（基础增长率：4/周）"

[Town_Xel.A_Xel_Sealstone H7TownUtilityUnitDwelling]
mName="石工坊"
mDesc="战争单位生产设施。\n允许招募封印石。"

[Town_Xel.A_Xel_Marketplace H7TownMarketplace]
mName="市场"
mDesc="允许进行资源交换。"

[Town_Xel.A_Xel_Moat H7TownMoat]
mName="护城河"
mDesc="为城镇装备护城河用于攻城战。\n穿过护城河的敌方生物会被中断行动，小型生物会被麻痹直到其下个回合结束。"

[Town_Xel.A_Xel_ResourceSilo H7TownSiloBuilding]
mName="仓库"
mDesc="每天随机提供1单位龙血水晶 %icon_Crystal、龙钢 %icon_Dragonsteel、影钢 %icon_Shadowsteel 或星银 %icon_Starsilver。"

[Town_Xel.A_Xel_Special2 H7TownBuilding]
mName="裂隙之门"
mDesc="你的单位在下一场战斗开始时获得裂隙斗篷（伤害护盾）。"

[Town_Xel.A_Xel_Special3 H7TownBuilding]
mName="守望者哨塔"
mDesc="增加访问英雄的 %icon_movement 移动力+5点，并增加 %icon_mana 最大法力值+15点，持续到本周末。"

[Town_Xel.A_Xel_Special4 H7TownBuilding]
mName="瘟疫釜"
mDesc="影响城市控制区域内的所有敌方英雄：移动力 %icon_movement 减少50%，攻击力 %icon_attack 减少3点，防御力 %icon_defense 减少3点。"

[Town_Xel.A_Xel_Special5 H7TownBuilding]
mName="防护图腾"
mDesc="在下一场战斗开始时，将对2个随机友方单位施放防护仪式（+5防御力 %ICON_DEFENSE，且此单位在3回合内无法被侧击）。"

[Town_Xel.A_Xel_Special6 H7TownBuilding]
mName="矿床"
mDesc="每天提供2单位 %icon_Ore 矿石。"

[Town_Xel.A_Xel_Special7 H7TownBuilding]
mName="奥术发生器"
mDesc="在此城市的控制区域内，你的英雄施放的 %icon_earth 土系法术获得1等级加成。"

[Town_Xel.A_Xel_Special8 H7TownBuilding]
mName="回收坑"
mDesc="提供500 %icon_gold 金币。"

[Town_Xel.A_Xel_ThievesGuild H7TownThiefGuild]
mName="潜行公会"
mDesc="允许购买关于你对手的信息。"

[Town_Xel.A_Xel_Grail H7TownTearOfAsha]
mName="帕拉克托斯"
mDesc="每天提供5000黄金 %ICON_GOLD，并增加此城中生物的产量50%。\n英雄获得传奇宝物帕拉克托斯。"

[Town_Xel.A_Xel_Town_ChargingStation_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="守望者哨塔能力"
mTooltip=""

[Town_Xel.A_Xel_Town_ChargingStation_Buff H7BaseBuff]
mName="守望者哨塔"
mTooltip="访问英雄获得 %stat1 移动力 %icon_movement 和 %stat2 最大法力值 %icon_mana，持续到本周末。"

[Town_Xel.A_Xel_Town_ProtectiveTotem_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="防护图腾能力"
mTooltip=""

[Town_Xel.A_Xel_Town_ProtectiveTotem_Buff H7BaseBuff]
mName="防护图腾"
mDesc="在下一场战斗开始时，将对2个随机友方单位施放防护仪式（访问英雄获得+5防御力 %ICON_DEFENSE，且该单位在3回合内无法被侧击）。"

[Town_Xel.A_Xel_Town_Reactor_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="瘟疫釜能力"
mTooltip=""

[Town_Xel.A_Xel_Town_Reactor_Buff H7BaseBuff]
mName="瘟疫釜"
mTooltip="敌方英雄的移动力 %icon_movement 减少50%。只要他们留在城市的控制区域内，他们的 %icon_attack 和 %icon_defense 就会降低。"

[Town_Xel.A_Xel_Town_RiftGate_Buff H7BaseBuff]
mName="通往裂隙之门"
mTooltip="所有友方生物在每场战斗开始时获得裂隙斗篷。"

[Town_Xel.A_Xel_Town_RiftGate_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="裂隙之门能力"
mTooltip=""

[Town_Xel.A_Xel_Town_Transmitter_Ability H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="奥术发生器能力"
mTooltip=""

[Town_Xel.A_Xel_Town_Transmitter_Buff H7BaseBuff]
mName="奥术发生器"
mTooltip="所有 %icon_earth 土系法术以大师等级施放。"
mDesc="所有土系法术以大师等级施放。"

[Town_Xel.A_Xel_TownPortal H7TownPortal]
mName="返回传送门"
mDesc="为所有访问此城市的英雄提供瞬间回城法术。\n允许拥有此法术的英雄返回此城市，如果这是最近的可用的城市。"

[Town_Xel.A_XelTownLv1 H7Town]
mName=""

[Town_Xel.H7XelTownNames H7GenericTownNames]
mTownNames[0]="泰克鲁克"
mTownNames[1]="里赫斯"
mTownNames[2]="特劳克"
mTownNames[3]="斯鲁格沃克斯"
mTownNames[4]="贝特"
mTownNames[5]="阿洛伊"
mTownNames[6]="萨斯特"
mTownNames[7]="奎尔津"
mTownNames[8]="弗里奎克"
mTownNames[9]="亚尔尊"
mTownNames[10]="乌西茨"
mTownNames[11]="伊基克"
mTownNames[12]="凯格诺克斯"
mTownNames[13]="祖斯"
mTownNames[14]="钦格尔"
mTownNames[15]="伊尔库"
mTownNames[16]="博罗克"
mTownNames[17]="奎尔斯"
mTownNames[18]="鲁希斯"
mTownNames[19]="维苏克"

[Army.A_ArmyBioTitan H7AdventureArmy]
mName=""

[Army.A_ArmyCocoon H7AdventureArmy]
mName=""

[Army.A_ArmyDeathbringer H7AdventureArmy]
mName=""

[Army.A_ArmyEnslaver H7AdventureArmy]
mName=""

[Army.A_ArmyJailer H7AdventureArmy]
mName=""

[Army.A_ArmyLeviathan H7AdventureArmy]
mName=""

[Army.A_ArmyLurker H7AdventureArmy]
mName=""

[Army.A_ArmyMineBeetle H7AdventureArmy]
mName=""

[Army.A_ArmyMineDevil H7AdventureArmy]
mName=""

[Army.A_ArmyMoloch H7AdventureArmy]
mName=""

[Army.A_ArmyMorlor H7AdventureArmy]
mName=""

[Army.A_ArmyRiftDemon H7AdventureArmy]
mName=""

[Army.A_ArmyRipper H7AdventureArmy]
mName=""

[Army.A_ArmyScapular H7AdventureArmy]
mName=""

[Army.A_ArmyScavenger H7AdventureArmy]
mName=""

[Army.A_ArmySearcher H7AdventureArmy]
mName=""

[Army.A_ArmySpawn H7AdventureArmy]
mName=""

[Army.A_ArmyStormViper H7AdventureArmy]
mName=""

[Army.A_ArmyVermin H7AdventureArmy]
mName=""

[Army.A_ArmyWerewolf H7AdventureArmy]
mName=""

[Army.A_ArmyXenophage H7AdventureArmy]
mName=""

[Town_Xel.A_Xel_Background H7TownBuilding]
mName="背景"
mDesc=""


Version 1.26 : 

[Abilities.A_RiftCloak_Buff_RiftGate H7BaseBuff]
mName="裂隙衬层"
mTooltip="吸收 %special.val3 伤害。如果护盾在 %durnow 回合内未被耗尽，它将消失。"

[Items.A_PaRaktos H7HeroItem]
mName="帕拉克托斯之心"
mTooltip="一件笼罩在传说中的宝物，蕴藏着弥赛亚的碎片，据一些人说，还有建筑师本人的灵魂。\n%stat1 %stat1.icon \n%stat2 %stat2.icon \n%stat3 %stat3.icon \n%stat4 %stat4.icon"

[Faction.A_Lore_FactionXel H7GeneralLoreEntry]
mName="秽巢"
mText="在亚山历史的早期，甚至在第一批杉提瑞造物出现之前，一颗陨石从天而降，撞击在亚山上。它包含一种具有罕见智慧和巨大知识的寄生虫。秽巢寄生虫以人类为宿主以求生存和繁衍。第一个被控制的人类被称为帕拉克托斯。但他创造的双足生物过于好斗，心智过于扭曲。经过多次冲突和濒临灭绝后，寄生虫躲藏到地下，寻找更容易操纵的宿主。它找到了小型、无智力、繁殖力强且高度繁殖的生物，人类称之为“老鼠”。几个世纪以来，寄生虫控制并突变这些小型生物，以实现其目的并向亚山地表复仇。第一批获得自由的人类保留了这个外星实体的一些知识，因此第一批杉提瑞机器诞生了。"

[Siege_map.H7FortressGateSegment H7CombatMapGate]
mObstacleName="城门"

[Siege_map.H7FortressGateSegment2 H7CombatMapGate]
mObstacleName="城门"

[Siege_map.H7FortressGateSegment3 H7CombatMapGate]
mObstacleName="城门"

[Siege_map.H7FortressWallSegment H7CombatMapWall]
mObstacleName="城墙"

[Siege_map.H7FortressWallSegment2 H7CombatMapWall]
mObstacleName="城墙"

[Siege_map.H7FortressWallSegment3 H7CombatMapWall]
mObstacleName="城墙"

[tower.A_TowerNecropolis_Attack H7BaseAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="塔楼攻击"
mTooltip="射击一个敌方生物，造成 %d.min 到 %d.max 伤害。"

[tower.H7_xel_TowerLeft H7CombatMapTower]
mObstacleName="射击塔"

[tower.H7_xel_TowerUnit H7TowerUnit]
mName="塔楼"
mLore=""

v1.37

Corrected Tower descrpition to explain defender stat gains
Made many corrections and tweaks to make descriptions across castles be more consistent and correct